; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	Star2 - direction
	Star5 - direction
	GroundStation7 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation1 - direction
	GroundStation8 - direction
	Star3 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(have_image Planet9 image0)
	(have_image Phenomenon10 image0)
	(have_image Planet11 thermograph1)
	(have_image Star12 image0)
	(have_image Planet13 image0)
	(have_image Planet14 image0)
	(have_image Planet15 thermograph1)
))

)

; plan
1. (turn_to satellite0 star3 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star3)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 planet13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet13)
   goals met: 0 of 7
5. (take_image satellite0 planet13 instrument0 image0)
   added: (have_image planet13 image0)
   goals met: 1 of 7
6. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 1 of 7
7. (take_image satellite0 planet11 instrument0 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 3 of 7
10. (turn_to satellite0 planet14 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet14)
   goals met: 3 of 7
11. (take_image satellite0 planet14 instrument0 image0)
   added: (have_image planet14 image0)
   goals met: 4 of 7
12. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 4 of 7
13. (take_image satellite0 planet15 instrument0 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 5 of 7
14. (turn_to satellite0 planet9 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet9)
   goals met: 5 of 7
15. (take_image satellite0 planet9 instrument0 image0)
   added: (have_image planet9 image0)
   goals met: 6 of 7
16. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 6 of 7
17. (take_image satellite0 star12 instrument0 image0)
   added: (have_image star12 image0)
   goals met: 7 of 7
